Tekla Open API Reference for Tekla Structures 2025
RebarLengthAdjustmentDataNullable Class
 The RebarLengthAdjustmentDataNullable class defines the length adjustment at the end of a reinforcing bar affected by a RebarEndDetailModifier. If a length adjustment property is null then that property will not be applied to the RebarSet generated reinforcing bars.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Model.RebarLengthAdjustmentDataNullable
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public class RebarLengthAdjustmentDataNullable
<SerializableAttribute>
Public Class RebarLengthAdjustmentDataNullable
The RebarLengthAdjustmentDataNullable type exposes the following members.
Constructors
Name | Description
RebarLengthAdjustmentDataNullable
 Initializes a new instance of the RebarLengthAdjustmentDataNullable class.
Top
Properties
Name | Description
AdjustmentLength
 Gets or sets the adjustment length.
AdjustmentType
 Gets or sets the adjustment type.
Top
See Also
Reference
Tekla.Structures.Model Namespace